{"_id":{"$oid":"65bbb7c5b8b6afb7fe6dd9c7"},"Title":"La Femme Nikita","Description":" Is a 1990 French-language action thriller film written and directed by Luc Besson.A teen criminal who is convicted and sentenced to life imprisonment for murdering policemen during an armed pharmacy robbery. Her government handlers fake her death and recruit her as a professional assassin. After intense training, she starts a career as a killer, where she struggles to balance her work with her personal life. She shows talent at this and her career progresses until a mission in an embassy goes awry.","Genre":["Action"],"Director":{"$oid":"65bbe38ab8b6afb7fe6dd9d0"},"Featured":true}
{"_id":{"$oid":"65bbbc1db8b6afb7fe6dd9c8"},"Title":"Interstellar","Description":"The movie follows a team of astronauts who embark on a space mission through a wormhole near Saturn to find a new habitable planet for humanity, as Earth faces environmental collapse. Interweaving elements of theoretical physics and emotional storytelling, the film explores themes of love, time dilation, and the survival of the human race.","Genre":["Science Fiction"],"Director":{"$oid":"65bbe440b8b6afb7fe6dd9d1"},"Featured":true}
{"_id":{"$oid":"65bbbf49b8b6afb7fe6dd9c9"},"Title":"The Prestige","Description":"Two stage magicians engage in competitive one-upmanship in an attempt to create the ultimate.","Genre":["Thriller"],"Director":{"$oid":"65bbe440b8b6afb7fe6dd9d1"},"Featured":true}
{"_id":{"$oid":"65bbc185b8b6afb7fe6dd9ca"},"Title":"Little Women","Description":"Jo March reflects back and forth on her life, telling the beloved story of the March sisters - four young women, each determined to live life on her own terms.","Genre":["Romance"],"Director":{"$oid":"65bbe93db8b6afb7fe6dd9d2"},"Featured":true}
{"_id":{"$oid":"65bbee8fb8b6afb7fe6dd9d5"},"Title":"Kill Bill: Volume 1","Description":"A pregnant assassin, code-named The Bride, goes into a coma for four years after her ex-boss Bill brutally attacks her. When she wakes up, she sets out to seek revenge on him and his associates.","Genre":["Action"],"Director":{"$oid":"65bbea0cb8b6afb7fe6dd9d3"},"Featured":true}
{"_id":{"$oid":"65bbefa4b8b6afb7fe6dd9d6"},"Title":"Barbie","Description":"Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.","Genre":["Comedy"],"Director":{"$oid":"65bbe93db8b6afb7fe6dd9d2"},"Featured":true}
{"_id":{"$oid":"65bbf095b8b6afb7fe6dd9d7"},"Title":"Spirited Away","Description":"Ten-year-old Chihiro and her parents end up at an abandoned amusement park inhabited by supernatural beings. Soon, she learns that she must work to free her parents who have been turned into pigs.","Genre":["Animation","Fantasy"],"Director":{"$oid":"65bbeac7b8b6afb7fe6dd9d4"},"Featured":true}
{"_id":{"$oid":"65bbf173b8b6afb7fe6dd9d8"},"Title":"Howl's Moving Castle","Description":"Jealous of Sophie's closeness to Howl, a wizard, the Witch of Waste transforms her into an old lady. Sophie must find a way to break the spell with the help of Howl's friends, Calcifer and Markl.","Genre":["Animation","Fantasy"],"Director":{"$oid":"65bbeac7b8b6afb7fe6dd9d4"},"Featured":true}
{"_id":{"$oid":"65bbf2bcb8b6afb7fe6dd9d9"},"Title":"Jackie","Description":"After the assassination of John F Kennedy, the President of the United States, his traumatised wife, Jacqueline, strives to cope with her grief and ensure her children's well-being.","Genre":["Biography","Drama"],"Director":{"$oid":"65bbe93db8b6afb7fe6dd9d2"},"Featured":true}
{"_id":{"$oid":"65bbf400b8b6afb7fe6dd9da"},"Title":"Inception","Description":"A skilled thief, Dom Cobb, is an expert in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state. Cobb's rare ability has made him a coveted player in the world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved.","Genre":["Science Fiction","Action"],"Director":{"$oid":"65bbe440b8b6afb7fe6dd9d1"},"Featured":true}
